{
    "Usuario": [
        
    ],
    "Cursos": [
        {
            "nome": "Fundamentos de Python",
            "conteudo": "A introdução à programação é o primeiro passo para entender como os computadores funcionam e como podemos interagir com eles para resolver problemas. Inicialmente, é comum encontrar dificuldades com as sintaxes das linguagens, mas com o tempo, o aprendizado se torna mais natural. Os conceitos fundamentais, como variáveis, operadores, loops e condicionais, são essenciais para criar algoritmos e são aplicados em diversas linguagens de programação, como Python e C++. À medida que o estudante avança, explora tópicos mais complexos, como estruturas de dados e funções, e a prática constante é crucial para aprimorar a habilidade. A programação oferece diversas possibilidades e é a base para o desenvolvimento de aplicativos, sites e soluções digitais.",
            "questoes": [
                {
                    "enunciado": "Qual é o principal benefício de aprender os conceitos fundamentais da programação, como variáveis, operadores, loops e condicionais?",
                    "alternativa_a": "a) Eles permitem criar algoritmos que podem ser aplicados em diversas linguagens de programação.",
                    "alternativa_b": "b) Eles eliminam a necessidade de prática constante durante o aprendizado.",
                    "alternativa_c": "c) Eles garantem que todas as dificuldades iniciais com sintaxes sejam completamente evitadas.",
                    "resposta": "alternativa_a"
                },
                {
                    "enunciado": "Qual dos seguintes conceitos fundamentais da programação é responsável por armazenar valores que podem ser utilizados e modificados ao longo do código?",
                    "alternativa_a": "a) Loops",
                    "alternativa_b": "b) Variáveis",
                    "alternativa_c": "c) Operadores",
                    "resposta": "alternativa_b"
                },
                {
                    "enunciado": "Qual das linguagens de programação a seguir é mencionada no texto como uma opção para aprender os conceitos básicos da programação?",
                    "alternativa_a": "a) JavaScript",
                    "alternativa_b": "b) Python",
                    "alternativa_c": "c) Ruby",
                    "resposta": "alternativa_b"
                }
            ]
        },
        {
            "nome": "Algoritmos de Ordenação",
            "questoes": [
                {
                    "enunciado": "Qual algoritmo de ordenação é mais eficiente para listas grandes?",
                    "alternativa_a": "a) Bubble Sort",
                    "alternativa_b": "b) Merge Sort",
                    "alternativa_c": "c) Selection Sort",
                    "resposta": "alternativa_b"
                },
                {
                    "enunciado": "O que o algoritmo de ordenação 'Bubble Sort' faz?",
                    "alternativa_a": "a) Ordena os elementos através de troca contínua entre vizinhos",
                    "alternativa_b": "b) Ordena dividindo a lista em partes menores",
                    "alternativa_c": "c) Ordena por inserção contínua",
                    "resposta": "alternativa_a"
                },
                {
                    "enunciado": "Qual é a complexidade temporal do algoritmo 'Quick Sort' no pior caso?",
                    "alternativa_a": "a) O(n)",
                    "alternativa_b": "b) O(n log n)",
                    "alternativa_c": "c) O(n²)",
                    "resposta": "alternativa_c"
                }
            ]
        },
        {
            "nome": "Banco de Dados com SQL",
            "questoes": [
                {
                    "enunciado": "O que faz o comando SQL SELECT * FROM tabela?",
                    "alternativa_a": "a) Exclui todos os dados da tabela",
                    "alternativa_b": "b) Atualiza os dados da tabela",
                    "alternativa_c": "c) Exibe todos os dados da tabela",
                    "resposta": "alternativa_c"
                },
                {
                    "enunciado": "Qual comando SQL é usado para excluir uma linha de uma tabela?",
                    "alternativa_a": "a) REMOVE",
                    "alternativa_b": "b) DELETE",
                    "alternativa_c": "c) DROP",
                    "resposta": "alternativa_b"
                },
                {
                    "enunciado": "O que faz o comando SQL INSERT INTO tabela (coluna1, coluna2) VALUES (valor1, valor2)?",
                    "alternativa_a": "a) Modifica os dados existentes na tabela",
                    "alternativa_b": "b) Insere uma nova linha na tabela",
                    "alternativa_c": "c) Cria uma nova tabela",
                    "resposta": "alternativa_b"
                }
            ]
        }    
    ]
}